In [6]:
import pandas as pd

bloodtypelist = ["A", "B", "O", "AB", "O", "A"]

namelist = ["Daniel", "Henry", "Danma", "Henli", "Man", "Flen"]

df = pd.DataFrame({"bloodtype": bloodtypelist, "name": namelist, "name_id": namelist})

df

  bloodtype    name name_id
0         A  Daniel  Daniel
1         B   Henry   Henry
2         O   Danma   Danma
3        AB   Henli   Henli
4         O     Man     Man
5         A    Flen    Flen

In [7]:
df.filter(like='name', axis = 1)

     name name_id
0  Daniel  Daniel
1   Henry   Henry
2   Danma   Danma
3   Henli   Henli
4     Man     Man
5    Flen    Flen